The DataFrame is very important data structure in the panda's library. It is very vital object when you work in data analysis and data cleaning.

The DataFrame is two-dimensional series object where there is an index and multiple column of content unlike Series objects which is basically a one column indexed array. 

In DataFrame each column have a label that helps in uniquely identifying the same. In Simple terms we can think of the DataFrame as simply as two-axes labeled array.

In [1]:
# Let's start learning dataframe by importing our pandas library

import pandas as pd

In [3]:
# Starting with an example. Let's create three school records for student and their
# class grades. I'll create a Series objects which will represent individual row
# in the DataFrame
# For instance,

record1 = pd.Series({
    "Name" : "David",
    "Subject" : "Physics",
    "Score" : 95
})
record2 = pd.Series({
    "Name" : "Helena",
    "Subject" : "Chemistry",
    "Score" : 89
})
record3 = pd.Series({
    "Name" : "Mark",
    "Subject" : "Maths",
    "Score" : 92
})

In [47]:
# Like a series, Dataframe object is also indexed. I'll use a group of series 
# For creating a dataframe. 
# Just, like a series we can pass the group of series as first argument in DataFrame
# and pass the list of indexes as second argument

df = pd.DataFrame([record1, record2, record3], index=["School1","School2","School1"])
df.head()

# Just like series we can use head function to display top 5 rows of dataframe.

           Name    Subject  Score
School1   David    Physics     95
School2  Helena  Chemistry     89
School1    Mark      Maths     92

In [128]:
# There are also alternative methods to create the same let'see all of them

records = [
    {
        "Name" : "David",
        "Subject" : "Physics",
        "Score" : 95
    },
    {
        "Name" : "Helena",
        "Subject" : "Chemistry",
        "Score" : 89
    },
    {
        "Name" : "Mark",
        "Subject" : "Maths",
        "Score" : 92
    }
    
]

df = pd.DataFrame(records, index = ["School1","School2","School1"])
df

           Name    Subject  Score
School1   David    Physics     95
School2  Helena  Chemistry     89
School1    Mark      Maths     92

In [49]:
## Another method

records = [
    ["David","Physics",95],
    ["Helena","Chemistry",89],
    ["Mark","Maths",92]
]
df = pd.DataFrame(records, columns =["Name","Subject","Score"], index = ["School1","School2","School1"])
df

           Name    Subject  Score
School1   David    Physics     95
School2  Helena  Chemistry     89
School1    Mark      Maths     92

In [50]:
# We can get each column individually just by using dot operator and by using square bracket

# for example

print(df.Name) # or df["Name"] 
print(df.Subject) # or df["Subject"] 
print(df.Score) # or df["Score"]

School1     David
School2    Helena
School1      Mark
Name: Name, dtype: object
School1      Physics
School2    Chemistry
School1        Maths
Name: Subject, dtype: object
School1    95
School2    89
School1    92
Name: Score, dtype: int64

In [53]:
# But for accessing the data from the data frames [] is considered more 
# efficient rather than . operator because of the limitation of . operator
# that is, . operator does not allow user to use Column name that contains 
# speacial charcaters

# So in that situitation square brackets becomes very handy.



# Similar to Series we can also extract data usign iloc and loc attributes.

# For example, if we want to select data associated with School1 , we can just jquery

df.loc["School1"] # Loc attribute allows you to query using index name

          Name  Subject  Score
School1  David  Physics     95
School1   Mark    Maths     92

In [54]:
# Similarly, For School2 and School3

print(df.loc['School2'])

Name          Helena
Subject    Chemistry
Score             89
Name: School2, dtype: object

In [56]:
# YOu will notice that for each query pandas return a row associated with index
# let's check what's is the type of this returnded output

type(df.loc["School2"])

pandas.core.series.Series

In [58]:
# You can see that the returned data type is Series.
# that means if we query data associated with any uinque index present in dataframe
# pandas will return Series objects right!!
# But what happens when data frame containes multiple row having same index value
# So in that case pandas will return DataFrame object as an output 
# Let's see that in the example
print(df.loc["School1"])
type(df.loc['School1'])

          Name  Subject  Score
School1  David  Physics     95
School1   Mark    Maths     92

pandas.core.frame.DataFrame

In [131]:
# We have something more uncommon and intresting feature that pandas Dataframe 
# containes, that is we can quickly select data based on lultiple axes.

# for Instance
# Creating new DatFrame
records = [
    {
        "Name" : "David",
        "Subject" : "Physics",
        "Score" : 95
    },
    {
        "Name" : "Helena",
        "Subject" : "Chemistry",
        "Score" : 89
    },
    {
        "Name" : "Mark",
        "Subject" : "Maths",
        "Score" : 92
    },
    {
        "Name" : "Julie",
        "Subject" : "English",
        "Score" : 96
    }
    
]

df = pd.DataFrame(records, index = ["School1","School2","School3","School4"])
df

           Name    Subject  Score
School1   David    Physics     95
School2  Helena  Chemistry     89
School3    Mark      Maths     92
School4   Julie    English     96

In [65]:
# Let's say we want to extract Data associated with Only school1 and school2
# we can just query

print(df.loc[["School1","School2"]])

           Name    Subject  Score
School1   David    Physics     95
School2  Helena  Chemistry     89

In [68]:
# All rows and specific columns
print(df.loc[ :, ["Name","Subject"]])

           Name    Subject
School1   David    Physics
School2  Helena  Chemistry
School3    Mark      Maths
School4   Julie    English

In [72]:
# Specific column and specific rows
df.loc[["School3","School4"],["Score","Subject"]]

         Score  Subject
School3     92    Maths
School4     96  English

In [75]:
# rows from school1 to school3 and Columns from Name to Subject

df.loc["School1":"School3","Name":"Subject"]

           Name    Subject
School1   David    Physics
School2  Helena  Chemistry
School3    Mark      Maths

In [79]:
# odd number rows and odd number column
df.loc[::2, ::2]

          Name  Score
School1  David     95
School3   Mark     92

In [81]:
# Similarly we can do all these stuff using iloc attribute only difference is 
# iloc takes index number instead of index values

# row 2 to 4 and odd number column

df.iloc[1:4, ::2]

           Name  Score
School2  Helena     89
School3    Mark     92
School4   Julie     96

In [88]:
# there are somethings to keep in mind
# 1. loc and iloc are used for row selection
# 2. these both attributes follow row first column second pattern
# 3. they both support slicing

# that means if we try to get Column from loc attribute it will produce key error

df.loc["Name"]

KeyError: 'Name'

In [89]:
# But accessing row will return the required output

df.loc["School1"]

Name         David
Subject    Physics
Score           95
Name: School1, dtype: object

In [90]:
# However , we can access the column by using . operator and using sqaure brackets\

df["Name"] # or df.Name

School1     David
School2    Helena
School3      Mark
School4     Julie
Name: Name, dtype: object

In [92]:
# Till now we've only talked about Accessing the data
# Let's talk about dropping data.
# It's very easy to delete data in Series and DataFrames we can use drop function
# to do so. 
# This fucntion takes only single parameter which is the index or row label.
# Drop function doesn't change the original dataframe instead it returns new Dataframe with modified value


df.drop("School2") # as you can see School2 row is removed from the output

          Name  Subject  Score
School1  David  Physics     95
School3   Mark    Maths     92
School4  Julie  English     96

In [93]:
# But if we look at the original dataframe we see the data is still intact
df

           Name    Subject  Score
School1   David    Physics     95
School2  Helena  Chemistry     89
School3    Mark      Maths     92
School4   Julie    English     96

In [102]:
# Drop has two optonal parameters
# Inplace : which tells the data gets update inplace ot not : Boolean 
# By default is False and but can change to true (data gets update in original dataframe)
# axis : tells which should be removed row or column : By deault 0 (row) 
# Howver we can switch it to 1 (column)


# For example
# let's create a copy of our original dataframe
copy_df = df.copy()
copy_df.drop("Name",inplace = True, axis = 1)
copy_df

# Original df is affected because inplace is true and column is removed since axix is 1

           Subject  Score
School1    Physics     95
School2  Chemistry     89
School3      Maths     92
School4    English     96

In [103]:
# There is second way to drop a column, and that is a directly deleting a column 
# from a dataframe using del keyword 

del copy_df["Score"]
copy_df

           Subject
School1    Physics
School2  Chemistry
School3      Maths
School4    English

In [104]:
# Column Score is removed from dataframe and also we can see original dataframe is
# also affected

In [132]:
# Finally adding a new column to existing dataframe is also very easy in pandas
# Simple assign data to indexing operator

# for example
# We want to add new Column grades in exisitng dataframe w can do so by
df["Grade"] = ["A","B","C","F"]
df

           Name    Subject  Score Grade
School1   David    Physics     95     A
School2  Helena  Chemistry     89     B
School3    Mark      Maths     92     C
School4   Julie    English     96     F

In [137]:
# Similarly is you want to add new row
df.loc["School5"] = pd.Series(
        {
            "Name" : "James",
            "Subject" : "Social Science",
            "Score" : 95,
            "Grade" : "A"
        })
df

           Name         Subject  Score Grade
School1   David         Physics     95     A
School2  Helena       Chemistry     89     B
School3    Mark           Maths     92     C
School4   Julie         English     96     F
School5   James  Social Science     95     A

In [138]:
# Some common things you should know
df.index # returns indexes

Index(['School1', 'School2', 'School3', 'School4', 'School5'], dtype='object')

In [139]:
df.columns # return column

Index(['Name', 'Subject', 'Score', 'Grade'], dtype='object')

In [140]:
df.size #return size of dataframe

20

In [141]:
df.shape # return shape (columns, row)

(5, 4)

In [143]:
df.head() # TOp 5 rows

           Name         Subject  Score Grade
School1   David         Physics     95     A
School2  Helena       Chemistry     89     B
School3    Mark           Maths     92     C
School4   Julie         English     96     F
School5   James  Social Science     95     A

In [144]:
df.tail() # Last 5 rows

           Name         Subject  Score Grade
School1   David         Physics     95     A
School2  Helena       Chemistry     89     B
School3    Mark           Maths     92     C
School4   Julie         English     96     F
School5   James  Social Science     95     A

In [148]:
df.describe() # Describe information of numberical data

           Score
count   5.000000
mean   93.400000
std     2.880972
min    89.000000
25%    92.000000
50%    95.000000
75%    95.000000
max    96.000000